Tekla Open API Reference for Tekla Structures 2025
BoltItem.Lengths Property
 The bolt item's length values.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<double> Lengths { get; }
Public ReadOnly Property Lengths As List(Of Double)
	Get
Property Value
Type: List<Double>
See Also
Reference
BoltItem Class
Tekla.Structures.Catalogs Namespace